<template>
    <section>
        <header class="main-section__header">
            <h1 class="main-section__title">
                Доставка
            </h1>
        </header>

        <div class="privacy">
            <p>
                Мы осуществляем доставку товара собственной службой доставки в согласованное с Вами время. Период доставки с 10.00 до 23.00. Доставка в праздничные и выходные дни согласовывается с менеджером вашего заказа.
            </p>
            <p>
                После совершения указанных действий Покупатель (получатель) либо расписывается в графе: "Заказ принял, комплектность полная, услуги по доставке оказаны, претензий к количеству и внешнему виду товара не имею. С условиями возврата товара ознакомлен". После получения заказа претензии к внешним дефектам товара, его количеству, комплектности и товарному виду не принимаются, либо составляет акт о выявленных недостатках в двух экземплярах. Ставя свою подпись, Покупатель (получатель) подтверждает, что он является уполномоченным на получение товара лицом.
            </p>
            <p>
                В случае если товар привезен не в полном объеме, присутствует пересорт, бой или брак, довоз товара производится за счет продавца в согласованный сторонами срок при наличии товара на складе или в срок 2-3 часов после поступления претензии, в случае его отсутствия.
                Условия возврата товара ненадлежащего качества
                Клиент вправе возвратить продавцу или не принять товар ненадлежащего качества и потребовать возврата уплаченной цены за товар(в том случае, если имеется не менее 80% от заказа, в качестве доказательства). Клиент также может потребовать замены товара ненадлежащего качества.
                Возврат денежных средств:
            </p>
            <p>
                Денежные средства подлежат возврату клиенту способом, аналогичным примененному им при оплате товара или иным способом по согласованию с клиентом.
            </p>
            <p>
                В случае, если возврат денежных средств осуществляется не одновременно с возвратом товара клиентом, возврат указанной суммы осуществляется продавцом по согласованию с клиентом одним из следующих способов:
            </p>
            <ul>
                <li>
                    наличными денежными средствами по месту нахождения продавца;
                </li>
                <li>
                    путем перечисления на банковский или иной указанный клиентом счет.
                    При аннулировании (отмене) заказа, возникновении проблем с оплатой, возврате денежных средств
                    При аннулировании позиций из оплаченного заказа (или при аннулировании заказа целиком) Вы можете заказать другой товар на эту сумму, либо вернуть всю сумму на карту, предварительно написав письмо на e-mail или позвонив по телефону суши-бара
                </li>
            </ul>
            <p>
                Возврат переведенных средств, производится на Ваш банковский счет в течение 5—30 рабочих дней (срок зависит от Банка, который выдал Вашу банковскую карту).
            </p>
        </div>
    </section>
</template>

<script lang="ts">
import { defineComponent } from "@vue/runtime-core";

export default defineComponent({
    created() {
        const title : any = this.$route.meta.title;
        
        if ( title ) document.title = 'Papakado — ' + title;
        else document.title = 'Papakado';
    },
});
</script>